case/3dCavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (2 0 0)
    (0 2 0)
    (2 2 0)
    
    (0 0 2)
    (2 0 2)
    (0 2 2)
    (2 2 2)
);

blocks
(
    // 1000
    // hex (0 1 3 2 4 5 7 6) (3 3 3) simpleGrading (0.5 1.2 1)
    hex (0 1 3 2 4 5 7 6) (10 10 10) simpleGrading (0.5 1.2 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 2 6 4)
            (0 1 5 4)
            (1 3 7 5)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (4 5 7 6)
            (0 1 3 2)
        );
    }
    // front
    // {
    //     type cyclic;
    //     neighbourPatch back;
    //     faces
    //     (
    //         (4 5 7 6)
    //     );
    // }

    // back
    // {
    //     type cyclic;
    //     neighbourPatch front;
    //     faces
    //     (
    //         (0 1 3 2)
    //     );
    // }
);

mergePatchPairs
(
);

// ************************************************************************* //
