case/3dCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            patch;
        nFaces          100;
        startFace       2700;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       2800;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       3100;
    }
)

// ************************************************************************* //
